#Задача 4
#Дана база даних продаж деякого інтернет-магазину. Кожен рядок вхідного файлу є записом виду Покупець товар кількість,
# де Покупець - ім'я покупця (рядок без пробілів), товар - назва товару (рядок без пробілів), кількість - кількість придбаних одиниць товару.
#Створіть список всіх покупців, а для кожного покупця підрахуйте кількість придбаних ним одиниць кожного виду товарів.
# Список покупців, а також список товарів для кожного покупця потрібно виводити в лексикографічному порядку.
mas = [
    ['Ann', 'komp', 2],
    ['Olga', 'meet', 1],
    ['Vasya', 'oil', 9],
    ['Vasya', 'oil', 9],
    ['Inna', 'dog', 2],
    ['Inna', 'komp', 1],
    ['Vasya', 'dog', 2],
    ['Ann', 'oil', 2],
    ['Inna', 'dog', 8]
]
mas.sort()
sp=[]

for i in mas:

    sp.append(i[0])
sp=set(sp)
m=list(sp)
m.sort()
for i in m:
    print(i)
    tov = {}
    for y in mas:
        if i==y[0]:
            kol = 0
            if y[1] in tov:
                bb=y[1]
                tov[bb]=tov[bb]+y[2]
            else:
                tov.update({y[1]: y[2]})


    for u in tov:
        print('     ', u,tov[u], 'шт')
    del(tov)

    
