#Задача 2.
#Порахувати кількість чисел більших (менших) за вказане число у одновимірному числовому масиві.
# Користувач сам вводить число і вказує які числа рахувати.
n=int(input("Введите число "))
zn = input("Что считать. Введите min или max")
kol=0
kol_m=0
arr=[1,2,3,4,5,6,7,8,9,10,11,12]
for i in arr:
    if zn=='min':
        if n>i:
            kol=kol+1
    elif zn=='max':
        if n<i:
            kol_m=kol_m+1
if zn=='min':
    print(kol)
elif zn=='max':
    print(kol_m)
else:
    print("Не понятно что вы счетаете")
