#Задача 2
'''Реалізуйте алгоритм стиснення текстового рядка символів за таким правилом.
str = 'aaaabbсaa' перетворюється в 'a4b2с1a2', тобто групи однакових символів
початкового рядка замінюються на цей символ і кількість його повторень в цій позиції рядка.
Напишіть програму, яка зчитує рядок, кодує її запропонованим алгоритмом і виводить
закодовану послідовність у консоль. Кодування повинно враховувати регістр символів.'''
s=input("Введите строку")
s=list(s)
nst=''
i=0
kol=0
t=0
count=len(s)
flag=True
while flag:
    one = s[i]
    while s[i]==one:
        t=t+1
        i=i+1
        if i==count:
            nst = nst + s[i - 1] + str(t)
            flag=False
            break
    else:
        nst = nst + s[i-1] + str(t)
        t=0

print(nst)
