#Задача 3
#Як відомо, в США президент обирається не прямим голосуванням,
# а шляхом дворівневого голосування. Спочатку проводяться вибори в кожному
# штаті і визначається переможець виборів в даному штаті. Потім проводяться державні вибори: на цих виборах кожен штат має певну
# кількість голосів - число представників від цього штату. На практиці, всі представники від штату голосують відповідно до результатів
# голосування в межах штату, тобто на заключній стадії виборів в голосуванні беруть участь штати, що мають різне число голосів.
#Кількість записів відповідає кількості штатів (50). Далі, кожен запис містить прізвище кандидата і число голосів, відданих за нього в
# одному зі штатів. Підведіть підсумки виборів: для кожного з учасника голосування визначте число відданих за нього голосів. Учасників
# потрібно виводити в алфавітному порядку.
USA = {
    'Alabama': ['Tramp', 1],
    'Alaska': ['Tramp', 1],
    'Arizona': ['Obama', 1],
    'Arkansas': ['Obama', 1],
    'California': ['Clinton', 12],
    'Colorado': ['Tramp',1],
    'Connecticut': ['Clinton', 70],
    'Delaware': ['Clinton', 30],
    'Florida': ['Tramp', 1],
    'Georgia': ['Tramp', 1],
    }
new_d={}
for i in USA:
    if USA[i][0] in new_d:
        bb = USA[i][0]
        new_d[bb] = new_d[bb] + USA[i][1]
    else:
        new_d.update({USA[i][0]:USA[i][1] })

print(new_d)